Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToElbow Property
 Failed to downgrade tee type to elbow type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedDowngradeCrossToElbow { get; }
Public Shared ReadOnly Property FailedDowngradeCrossToElbow As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedDowngradeCrossToElbow {
	FailureDefinitionId^ get ();
}
static member FailedDowngradeCrossToElbow : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace